Revit 2027 API
SolidCurveIntersection.GetCurveSegment Method
 Gets the curve segment generated by intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetCurveSegment(
	int index
)
Public Function GetCurveSegment (
	index As Integer
) As Curve
public:
Curve^ GetCurveSegment(
	int index
)
member GetCurveSegment :
        index : int -> Curve
Parameters
index Int32
 The index.
Return Value
Curve
 The curve.
Exceptions
Exception | Condition
ArgumentException |  index is out of range.
See Also
Reference
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace